Repository: NathanBnm/pebbles
Catalog: po/extra/*.po
Languages: fr

source: Pebbles Calculator App
fr: Calculatrice Pebbles

source: Perform advanced calculations with ease
fr: Effectuez des calculs avancés facilement

source: calculator;scientific;programmer;statistics;converter;convert;calculate;boolean;
fr: calculatrice;scientifique;programmeur;statistiques;convertisseur;convertir;calculer;booléen;

source: Open in Mini Mode
fr: Ouvrir en mode réduit

source: Open a New Window
fr: Ouvrir une nouvelle fenêtre

source: An advanced calculator that helps you with complicated calculations in your homework
fr: Une calculatrice avancée pour vous aider avec les calculs compliqués dans vos devoirs

source: Features:
fr: Fonctionnalités :

source: Scientific mode
fr: Mode scientifique

source: Programmer mode
fr: Mode programmeur

source: Calculus mode
fr: Mode calcul

source: Statistics mode
fr: Mode statistiques

source: Date Calculation mode
fr: Mode calcul de dates

source: Some common unit converters
fr: Convertisseurs d'unités usuelles

source: Scientific Mode
fr: Mode scientifique

source: Calculus Mode
fr: Mode calcul

source: Statistics Mode
fr: Mode statistiques

source: Programmer Mode
fr: Mode programmeur

source: Date Mode
fr: Mode date

source: Speed Unit Converter Mode
fr: Mode convertisseur d'unités de vitesse

source: Currency Unit Converter Mode
fr: Mode convertisseur de devises

source: Improved:
fr: Amélioré :

source: [Programmer] Transition to integer-integer logic for all operations
fr: [Programmeur] Passage à la logique des nombres entiers pour toutes les opérations

source: Translations:
fr: Traductions :

source: Simplified Chinese (by Tommy He)
fr: Chinois simplifié (par Tommy He)

source: Fixed:
fr: Corrigé :

source: [Converter] Fix multiple errors in the converters
fr: [Convertisseur] Correction de diverses erreurs de conversion

source: [UI] Scale button font with app width (a11y)
fr: [Interface] Agrandissement de la police des boutons en fonction de la taille de l'application (a11y)

source: [Core] Intelligently convert expression when there is a percentage sign
fr: [Noyau] Conversion intelligente des expressions lorsque le symbole pourcentage est présent

source: [Core] Clean up useless debug prints, clean up console output
fr: [Noyau] Nettoyage des journaux de débogage inutiles, nettoyage de la sortie console

source: [UI] Follow elementary theme even when run on another distro
fr: [Interface] Respect du thème d'elementary même sur les autres distributions

source: New:
fr: Nouveau :

source: [UI] Make UI resizable and responsive with touch support
fr: [Interface] L'interface peut désormais être redimensionnée et prend en charge les interactions tactiles

source: [UI] Follow system-wide dark style preference
fr: [Interface] Respect du paramètre du thème sombre

source: [UI] Updated CSS to be in tune with style of elementary OS 6 Odin
fr: [Interface] Mise à jour des CSS pour correspondre à la charte d'elementary OS 6 Odin

source: [Calculus] Prevent divide by zero errors, use "tends to zero" logic
fr: [Calcul] Correction des erreurs de division par zéro, logique qui « tend vers zéro »

source: [Calculus] Add ability to input negative and fractional limits
fr: [Calcul] Ajout de la possibilité de saisir des nombres négatifs ou des fractions comme limites

source: [Calculus] Add ability to modify integration accuracy
fr: [Calcul] Ajout de la possibilité de modifier la précision de l'intégration

source: [Programmer] Remove leading '0's correctly
fr: [Programmeur] Suppression correcte des 0 restants

source: [Core] Insert result in history from any mode to any mode
fr: [Noyau] Insérez des résultats de l'historique depuis et vers n'importe quel mode

source: [Core] Persist History across invocations
fr: [Noyau] L'historique est désormais persisté entre ses appels

source: [Programmer] Better binary formatting
fr: [Programmation] Meilleur formattage des nombres binaires

source: [Programmer] Implement Programmer mode
fr: [Programmeur] Implémentation du mode Programmeur

source: [UI] Fix minimode having wrong button label
fr: [Interface] Correction d'un mauvais nom de bouton en mode réduit

source: [UI] Allow changing currency converter API key
fr: [Interface] Il est désormais possible de modifier la clé d'API du convertisseur de devises

source: [Core] Handle large factorials
fr: [Noyau] Prise en charge des grandes factorielles

source: [Core] Replace imaginary number with universal parabolic constant
fr: [Noyau] Remplacement du nombre imaginaire par la constante parabolique universelle

source: [Core] Fix operator precedance
fr: [Noyau] Correction de la primauté des opérateurs

source: [UI] Allow navigation left and right buttons to pass through selectively
fr: [Interface] Il est désormais possible de naviguer de gauche à droite avec les boutons respectifs

source: [Core] Better negative number handling
fr: [Noyau] Meilleure gestion des nombres négatifs

source: [Core] Implicit multiplication on parenthesis and around variable (x)
fr: [Noyau] Multiplication implicite sur les parenthèses et autour de la variable (x)

source: [UI] Comma and Radix symbols now obey Language &amp; Region settings
fr: [Interface] Les signes de ponctuation Virgule et Point suivent désormais les paramètres de langue et de région

source: [UI] Backspace button should now check if input entry has text on start up
fr: [Interface] Le bouton Effacer vérifie désormais si le champ de saisie contient du texte au démarrage

source: [Core] Fix precedance with proper PEMDAS rule
fr: [Noyau] Correction de la primauté avec la règle PEMDAS

source: [UI] Better clipboard system for Scientific, Calculus, Statistics and converters
fr: [Interface] Meilleure gestion du presse-papiers pour les modes Scientifique, Calcul, Statistiques et les convertisseurs

source: [UI] Save and restore calculator state across invocations
fr: [Interface] Sauvegarde et restauration de l'état des calculs entre les appels

source: [Converter] Save currency converter forex data after update
fr: [Convertisseur] Sauvegarde des données Forex après mise à jour

source: [Calculus] Fix derivative accuracy bug which caused it to output zero everytime
fr: [Calcul] Correction d'un bug de précision de la dérivation causant toujours un résultat à zéro

source: French (by Nathan Bonnemains)
fr: Français (par Nathan Bonnemains

source: Code structure fixed and improved by Nathan Bonnemains
fr: Structure du code corrigée et améliorée par Nathan Bonnemains

source: [Calculus] Make Calculus button labels consistent with Scientific view
fr: [Calcul] Le texte des boutons du mode Calcul sont désormais cohérents avec le mode Scientifique

source: [Controls] Use Escape Key to close dialogues
fr: [Contrôles] Utilisez la touche Échap pour fermer les boîtes de dialogue

source: [Converter] Override conversion precision based on unit for Currency and Data converter
fr: [Convertisseur] Conversions unitaires plus précises pour les convertisseurs de devises et de données

source: [Controls] Use F7 for last answer and F8 for changing angle mode
fr: [Contrôles] Utilisez F7 pour récupérer la dernière réponse et F8 pour modifier le mode d'angle

source: [HeaderBar] Change 'GRD' to 'GRA'
fr: [Barre de titre] Modification de « GRD » en « GRA »

source: [Date View] Enable counting date backwards
fr: [Vue date] Possibilité de calculer la date à rebours

source: [Translations] Add more translatable strings
fr: [Traduction] Plus de chaînes sont désormais disponibles pour la traduction

source: Initial Release
fr: Version initiale
